app/controllers/organizations_controller.rb

  def list
    @organizations = Organization.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM "organizations" LIMIT 10 OFFSET 0

  def select_state
    @country = BSC::Country.find(params[:country_id])
---
SELECT * FROM "countries" WHERE ("countries"."id" = 30)