app/controllers/users_controller.rb

  def login
    return unless request.post?
    self.current_user = User.authenticate(params[:login], params[:password])
    if current_user
      if params[:remember_me] == "1"
        self.current_user.remember_me
        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
      end
      flash[:notice] = _("Logged in successfully")
      if self.current_user.organizations.count == 1
---
SELECT count(*) AS count_all FROM "organizations" INNER JOIN "profiles" ON "organizations".id = "profiles".organization_id WHERE (("profiles".user_id = 1))